In [1]:
import ast
import numpy as np
from pprint import pprint

import pandas as pd
pd.set_option('display.max_columns', None)

from kindlib.fluff import *

In [2]:
### Caracterizaçãocdf = pd.read_pickle('data/credits.pkl')
kdf = pd.read_pickle('data/keywords.pkl')
mdf = pd.read_pickle('data/movies_metadata.pkl')
rdf = pd.read_pickle('data/ratings.pkl')

### <center>Caracterização</center>

In [3]:
mdf.head(3)

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",21.9469,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,17.0155,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,"[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,11.7129,/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg,"[{'name': 'Warner Bros.', 'id': 6194}, {'name'...","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-22,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92.0

In [4]:
colstats = pd.DataFrame(data=[(c, mdf[c].dtype, mdf[c].nunique(), mdf[c].isna().sum()) for c in mdf.columns], columns=['col', 'type', 'nunique', 'nan'])

print('Total number of entries:', len(mdf))
colstat = []
for idx, row in colstats.iterrows():
    df = pd.DataFrame(data=row).drop('col').rename(columns={idx:colstats['col'].iloc[idx]}).T
    df.index.name = 'Feature'
    if int(df['nunique']) <= 10:
        df2 = pd.DataFrame(mdf[row['col']].unique(), columns=['values'])
        p(df, df2)
    else:
        display(df)
    print('')

Total number of entries: 45466

                         type nunique    nan
Feature
belongs_to_collection  object    1698  40972

           type nunique nan
Feature
budget   object    1226   0

           type nunique nan
Feature
genres   object    4069   0

            type nunique    nan
Feature
homepage  object    7673  37684

           type nunique nan
Feature
id       object   45436   0

           type nunique nan
Feature
imdb_id  object   45417  17

                     type nunique nan
Feature
original_language  object      92  11

                  type nunique nan
Feature
original_title  object   43373   0

            type nunique  nan
Feature
overview  object   44307  954

              type nunique nan
Feature
popularity  object   44176   5

               type nunique  nan
Feature
poster_path  object   45024  386

                        type nunique nan
Feature
production_companies  object   22708   3

                        type nunique nan
Feature
production_countries  object    2393   3

                type nunique nan
Feature
release_date  object   17336  87

            type nunique nan
Feature
revenue  float64    6863   6

            type nunique  nan
Feature
runtime  float64     353  263

                    type nunique nan
Feature
spoken_languages  object    1931   6

           type nunique    nan
Feature
tagline  object   20283  25054

           type nunique nan
Feature
title    object   42277   6

                 type nunique nan
Feature
vote_average  float64      92   6

               type nunique nan
Feature
vote_count  float64    1820   6

In [5]:

mdf = mdf.drop(columns=['belongs_to_collection', 'homepage', 'runtime'])

| Dropped columns       | Reason                       | Alternative                              |
| --------------------- |:----------------------------:| ----------------------------------------:|
| belongs_to_collection | too many nans                | &nbsp;&nbsp;convert to bool              |
| homepage              | too many nans                | &nbsp;&nbsp;convert to bool              |
| runtime               | estimation pollutes analysis | &nbsp;&nbsp;use mean or median of others |

In [6]:

mdf = mdf[mdf['adult'] == 'False'].append(other=mdf[mdf['adult'] == 'True'], verify_integrity=True)

| Dropped rows count | Reason | Alternative |
| --- |:---:| ---:|
| xxx | yyy | zzz |

<hr>

In [ ]:
## this is safer than eval to parse the json in df's fields
#ast.literal_eval(cdf['crew'].iloc[0])

<hr>

### <center>Testes de Hipótese</center>

#### I. H<sub>0</sub>: O revenue de filmes do mesmo gênero não é influenciado pela data de lançamento.

#### II. H<sub>0</sub>: A média de idade dos 10 atores principais está correlacionada com os ratings.

### <center>Regressão</center>

#### Least Squares

### <center>Classificação</center>

#### Hidden Markov Model

### <center>Agrupamento</center>

#### DBScan

### <center>Relatório Final:</center>
<br>

#### Sua análise dos dados deve apresentar:
- Uma caracterização (análise exploratória) inicial dos dados **(2pts)**
- Pelo menos, dois testes de hipótese/intervalos de confiança **(2pts)**
    - Os ICs podem ser apresentados nos resultados de regressão e classificação abaixo.
    - Os testes de hipótese também podem ser utilizados abaixo para comparar modelos.
- Pelo menos uma regressão **(3pts)**
- Pelo menos um algoritmo de aprendizado/classificação **(3pts)**

#### No seu relatório, você deve apresentar pelo menos os seguintes pontos:
- Introdução com Motivação e Pergunta de Pesquisa
- Metodologia
- Descreva sua base
- Quais métodos e modelos foram utilizados. Justifique os mesmos.
- Resultados. Sugiro separar em
    - Caracterização (análise exploratória)
    - Testes de hipótese podem vir aqui.
    - Previsão (uma ou duas sub-seções dependendo dos modelos utilizados)
    - Conclusões

Responda suas perguntas:
- Qual a melhor época do ano para anunciar e lançar um filme?
- Como a popularidade dos gêneros dos filmes evoluiu ao longo dos anos?
- Qual o peso de um ator/atriz popular no retorno financeiro de um filme com avaliação "ruim"?

### Vídeo
Vídeo no Youtube 5 minutos (pode ser um vídeo só de slides) **(5pts)**